[
    {
        "thumbnail": "../../assets/posts/zoomelaka.png",
        "http": "https://github.com/ChathushkaRodrigo/ZooMelaka-Management-System",
        "date": "06-10-2021",
        "internationalizations": [
            {
                "language": "en",
                "title": "Zoo Melaka Management System",
                "description": " <b> Melaka Zoo </b> was in need of a <b> Management System </b> to procure thier day to day work to be done on an online platform where visitors and working staff can engage in activities in an online portal based manner. Developed using <b> M.E.R.N </b> stack technology <br><br> <b>MERN JIRA GITHUB </b> "
            },
            {
                "language": "sn",
                "title": "A fórmula de matriz 2D anti-deslocamento.",
                "description": "Você já pensou na <b>relação matemática</b> entre as<i> colunas</i> e as <i>linhas</i> de uma matriz bidimensional <i>(matriz 2d)</i>? Essa estrutura de dados oculta uma <b>fórmula de localização de dados</b> que me ajudou a evitar a <i>complexidade de tempo de O(n²)</i>, que é um cenário péssimo, transformando-a em uma <i>complexidade do tempo constante - O(1)</i>. Uma explicação completa, com casos de teste reais e testes de unidade, está esperando por você."
            }
        ]
    },
    {
        "thumbnail": "../../assets/posts/spinner.png",
        "http": "https://github.com/ChathushkaRodrigo/Spinner-Bike-Managment-1",
        "date": "05-1-2021",
        "internationalizations": [
            {
                "language": "en",
                "title": "Spinner Cycling Android Mobile App",
                "description": "There were numerous vacancies for <i>web developers</i> on the wall, at the same time, <b>12.7 million people were unemployed</b> in Brazil, such a sad situation persisted in my mind. Back at my house, I've recalled a free course, offered by the renowned <i>Bob Tabor (Senior Program Manager at Microsoft)</i>, present at Microsoft Virtual Academy."
            },
            {
                "language": "sn",
                "title": "Em 2019, saia do desemprego! Seja você um Web Developer.",
                "description": "Lá estavam no mural, inúmeras vagas para desenvolvedor web. E ao mesmo tempo, haviam <b>12,7 Milhões de compatriotas desempregados</b> e tais vagas em aberto ficaram matutando em minha cabeça. De volta à minha casa, me recordo de um curso gratuito, disponibilizado pelo renomado <i>Bob Tabor (Senior Program Manager na Microsoft)</i>, presente na Microsoft Virtual Academy."
            }
        ]
    },
    {
        "thumbnail": "../../assets/posts/onlinehelpdesk.png",
        "http": "https://github.com/ChathushkaRodrigo/OnlineHelpDesk",
        "date": "02-12-2021",
        "internationalizations": [
            {
                "language": "en",
                "title": "Online Help Desk ",
                "description": "For great user experience, the usage of maps together with the ordered list is used very often in mobile applications. This article presents an open-source application for Android that provides a fully functional component."
            },
            {
                "language": "sn",
                "title": "Navegação por Item no Mapa para Android - <i>Componente de código aberto</i>.",
                "description": "Para uma ótima experiência do usuário, o uso de mapas junto com a lista ordenada é usado com muita frequência em aplicativos móveis. Este artigo apresenta um aplicativo de código aberto para Android que fornece um componente totalmente funcional."
            }
        ]
    },
    {
        "thumbnail": "../../assets/posts/kurumba.png",
        "http": "https://github.com/ChathushkaRodrigo/Kurumba-Jobs",
        "date": "05-05-2020",
        "internationalizations": [
            {
                "language": "en",
                "title": "Kurumba Online Job Portal",
                "description": "Nowadays, <b>geolocation</b> is essential for most of the basic daily activities. Who never have asked Google where is the closest market?  In this article, I show a practical example of how to create a <i>SQL Query</i> that does a geolocational search based on a radius range and a fixed geolocational point."
            },
            {
                "language": "sn",
                "title": "Pesquisa por distância geográfica com MySQL e PHP.",
                "description": "Atualmente, a <b>geolocalização</b> é essencial para a maioria das atividades diárias básicas. Quem nunca perguntou ao Google onde está o mercado mais próximo? Neste artigo, mostro um exemplo prático de como criar uma <i>consulta SQL</i> a qual faz uma pesquisa geolocalizada com base em um raio de abrangência e um ponto geográfico fixo."
            }
        ]
    },
    {
        "thumbnail": "../../assets/posts/missingwallet.png",
        "http": "https://github.com/ChathushkaRodrigo/DrunkDude",
        "date": "12-20-2020",
        "internationalizations": [
            {
                "language": "en",
                "title": "Missing Wallet Unity 2D Game",
                "description": "With the appliance of the email security policy on the <i>Web 2.0</i> came the need to take measures that would hinder the practice of <i>spamming</i>, among the measures taken,  it is the use of authenticated e-mail, which means that for each e-mail sent, we would have the <i>signature</i> of the host who sent it, thus, there would be greater control over who, eventually, practice the spamming. In this article, I show you how to send the authenticate e-mail, increasing the chances of your email get read by the target user."
            },
            {
                "language": "sn",
                "title": "Envio de e-mail autenticado em PHP.",
                "description": "Com a aplicação da política de segurança de email na <i>Web 2.0</i>, surgiu a necessidade de tomar medidas que dificultassem a prática do <i>spamming</i>, entre as medidas adotadas, está o uso de e-mail autenticado, o que significa que, para cada e-mail enviado, teríamos a <i>assinatura</i> do host que o enviou, assim, haveria maior controle sobre quem, eventualmente, praticasse o spam. Neste artigo, mostrarei como enviar o email de autenticação, aumentando as chances de seu email ser lido pelo usuário de destino."
            }
        ]
    }
    
]